Repository: franknguyenit/web-imm-translation
Catalog: bo-nho-dich/bo-nho-dich.tmx
Source language: vi
Languages: en

source: Trong suốt quá trình phát triển của mình, IMM Group đã kết hợp, hợp tác với rất nhiều các văn phòng luật sư, công ty di trú, các dự án lớn trên toàn thế giới. Điều này nhằm tạo cho khách hàng có một nền tảng cố vấn vững chắc về chuyên môn, cũng như sự an tâm khi đầu tư vào những dự án mang thương hiệu lớn, có sẵn uy tín, lịch sử thành công lâu đời.
en: Over the course of its growth, IMM Group has worked with a wide range of law firms, immigration companies, and major projects around the world. These relationships give clients a solid foundation of professional advice, along with added confidence when considering projects from established brands with long track records of success.

source: Chứng nhận hợp tác quốc tế của IMM Group
en: IMM Group's international partnership certificates

source: Tháng 03/2022
en: March 2022

source: Chứng nhận IMM Group là đối tác kinh doanh chiến lược của Canvantage
en: IMM Group certified as a strategic business partner of Canvantage

source: IMM Group là đối tác của MA Financial Group - Quỹ đầu tư danh tiếng tại Úc
en: IMM Group is a partner of MA Financial Group, a reputable investment fund in Australia

source: Chứng nhận IMM Group là đối tác của Pafilia - Công ty phát triển dự án bất động sản tại Cộng Hòa Síp
en: IMM Group certified as a partner of Pafilia, a real estate developer in the Republic of Cyprus

source: Từ 2022
en: Since 2022

source: Chứng nhận IMM Group là đối tác của Aristo Developers - Nhà phát triển bất động sản dân cư hàng đầu Cộng Hòa Síp (Cyprus)
en: IMM Group certified as a partner of Aristo Developers, a leading residential property developer in the Republic of Cyprus

source: Từ 31/10/2022
en: Since October 31, 2022

source: Chứng nhận IMM Group là đối tác của Estudio Jurídico Gold Millennium Group
en: IMM Group certified as a partner of Estudio Jurídico Gold Millennium Group

source: IMM Group là đối tác của EB5 Capital - Trung tâm vùng nổi tiếng của Mỹ chuyên về đầu tư định cư diện EB-5
en: IMM Group is a partner of EB5 Capital, a well-known U.S. regional center specializing in EB-5 immigrant investment

source: Chứng nhận IMM Group là đối tác của CanAm Enterprises - Trung tâm vùng lâu đời nhất tại Mỹ chuyên về đầu tư định cư diện EB-5
en: IMM Group certified as a partner of CanAm Enterprises, the longest-established regional center in the U.S. specializing in EB-5 immigrant investment

source: Chứng nhận IMM Group là đối tác chiến lược của OneWorld Group - Công ty phát triển dự án bất động sản tại Turkey
en: IMM Group certified as a strategic partner of OneWorld Group, a real estate developer in Turkey

source: Từ 04/11/2021
en: Since November 4, 2021

source: Chứng nhận IMM Group là đối tác của V2 Development - Nhà phát triển bất động sản dân cư hàng đầu Hy Lạp
en: IMM Group certified as a partner of V2 Development, a leading residential property developer in Greece

source: Chứng nhận IMM Group là đối tác của Irish Diaspora Loan Fund (IDLF) - Quỹ đầu tư đầu tiên được thành lập dành riêng cho Chương trình đầu tư định cư Ireland
en: IMM Group certified as a partner of the Irish Diaspora Loan Fund (IDLF), the first investment fund established exclusively for Ireland's Immigrant Investor Programme

source: IMM Group là đại diện chính thức, được ủy thác bởi Văn phòng luật Frendo Advisory (Giấy phép số: AKM-FREN-21), đáp ứng đủ điều kiện để về việc tiếp thị và tư vấn các chương trình đầu tư quốc tịch Malta
en: IMM Group is an official representative authorized by the law firm Frendo Advisory (License No. AKM-FREN-21) and is eligible to market and advise on Malta's citizenship by investment programs

source: Từ 2021
en: Since 2021

source: IMM Group là đối tác chiến lược của Southeast Regional Center - SRC - Trung tâm vùng nổi tiếng của Mỹ chuyên về đầu tư định cư diện EB-5
en: IMM Group is a strategic partner of Southeast Regional Center (SRC), a well-known U.S. regional center specializing in EB-5 immigrant investment

source: Chứng nhận IMM Group là đối tác của Range Developments - Nhà cung cấp các dự án Đầu tư lấy quốc tịch hàng đầu tại vùng Caribbean (Grenada, Saint Kitts, Dominica)
en: IMM Group certified as a partner of Range Developments, a leading provider of citizenship by investment projects in the Caribbean (Grenada, Saint Kitts, Dominica)

source: Chứng nhận IMM Group là đối tác của Secret Bay Residences Limited - Nhà phát triển dự án bất động sản nghỉ dưỡng cao cấp tại Caribbean
en: IMM Group certified as a partner of Secret Bay Residences Limited, a developer of luxury resort real estate in the Caribbean

source: Từ 2020
en: Since 2020

source: Chứng nhận IMM Group là đối tác của Apex Capital - Công ty tư vấn đầu tư bất động sản lấy quốc tịch Montenegro
en: IMM Group certified as a partner of Apex Capital, a consulting firm for citizenship by real estate investment in Montenegro

source: Chứng nhận IMM Group là đối tác của Arish Capital - Công ty phát triển dự án bất động sản tại Bồ Đào Nha
en: IMM Group certified as a partner of Arish Capital, a real estate developer in Portugal

source: Từ 2019
en: Since 2019

source: IMM Group là đối tác của MIBS Group - Tập đoàn phát triển dự án uy tín cho chương trình đầu tư lấy Golden Visa Hy Lạp
en: IMM Group is a partner of MIBS Group, a reputable project development group for the Greece Golden Visa program

source: Từ 2012
en: Since 2012

source: Chứng nhận IMM Group là đối tác của Bartra Wealth Advisors - Một trong những nhà phát triển bất động sản thành công nhất Ireland
en: IMM Group certified as a partner of Bartra Wealth Advisors, one of the most successful real estate developers in Ireland

source: IMM Group trên các kênh truyền thông
en: IMM Group in the media

source: Đại diện IMM Group xuất hiện trên nhiều phương tiện truyền thông, báo đài trên các kênh chính thống, phủ sóng toàn quốc với tư cách chuyên gia di trú cho ý kiến về lĩnh vực định cư, luật đầu tư nước ngoài.
en: IMM Group representatives have appeared across mainstream national television, radio, and print media in Vietnam as immigration experts, commenting on residency and foreign investment law.

source: Duy nhất là đơn vị xuất hiện trên VTV1 trao đổi về quan hệ hợp tác Việt Nam – Mỹ và các chương trình đầu tư như **EB-5** trước lúc Tổng thống Obama qua Việt Nam. Bên cạnh đó, IMM Group còn là đơn vị trao đổi thông tin nhiều trên các kênh HTV và VTC.
en: IMM Group was the only firm to appear on VTV1 discussing Vietnam–U.S. cooperation and investment programs such as **EB-5** ahead of President Obama's visit to Vietnam. IMM Group has also frequently shared insights on HTV and VTC.

source: Tháng 08/2017 | VTV1
en: August 2017 | VTV1

source: Ông Trần Văn Tỉnh (Tony Tỉnh), nhà sáng lập IMM, chia sẻ cơ hội giao thương Việt Mỹ - Chương trình Tạp Chí Kinh Tế Cuối Tuần
en: Mr. Tran Van Tinh (Tony Tinh), founder of IMM, shares Vietnam–U.S. trade opportunities – Weekend Economic Review program

source: Bằng việc phỏng vấn nhiều chuyên gia kinh tế tại Mỹ cũng như trò chuyện cùng ông Trần Văn Tỉnh (Tony Tỉnh), người đã có 10 năm làm việc trong lĩnh vực EB-5, chương trình đã đề cập một cách…
en: Through interviews with several economic experts in the U.S. and a conversation with Mr. Tran Van Tinh (Tony Tinh), who had spent 10 years working in the EB-5 field, the program explored…

source: IMM Group kết hợp cùng VTC thực hiện phóng sự chia sẻ cơ hội đầu tư vào Cộng Hòa Síp (Cyprus)
en: IMM Group and VTC produce a report on investment opportunities in the Republic of Cyprus

source: IMM Group là đơn vị di trú đầu tiên ở Việt Nam được Cybarco cấp quyền đại diện. Cybarco trực thuộc Tập đoàn Lanitis, một trong những tập đoàn lớn nhất Cộng Hòa Síp. Uy tín của Lanitis đã xác…
en: IMM Group is the first immigration firm in Vietnam granted representation rights by Cybarco. Cybarco is part of the Lanitis Group, one of the largest corporations in the Republic of Cyprus. Lanitis's reputation has been…

source: Tháng 05/2017 | HTV9
en: May 2017 | HTV9

source: Lời khuyên khởi nghiệp từ cậu bé bán tàu hủ năm xưa - Chương trình Chuyển Động Kinh Doanh
en: Startup advice from the boy who once sold tofu – Business Movement program

source: Nếu muốn khởi nghiệp mà chỉ xoay quanh đam mê thì nó sẽ lòng vòng, sẽ không đâu vào đâu. Mà cái đam mê nó cũng là thứ sẽ thay đổi, hôm nay bạn mê cái này, mai bạn mê…
en: If you build a startup around passion alone, you will go in circles and get nowhere. Passion also changes: today you love one thing, tomorrow you love…

source: Tháng 10/2016 | VTC8
en: October 2016 | VTC8

source: Phóng sự: “Nhà đầu tư nên làm gì trước sự thay đổi của chương trình EB-5"
en: Report: "What should investors do as the EB-5 program changes?"

source: Trong phóng sự: “Nhà đầu tư nên làm gì trước sự thay đổi của chương trình EB-5”, phát sóng ngày 10/10/2016 trên kênh truyền hình VTC8, anh Trần Văn Tỉnh (Tony Tỉnh) (Tổng giám đốc – Sáng lập viên IMM…
en: In the report "What should investors do as the EB-5 program changes?", aired on VTC8 on October 10, 2016, Mr. Tran Van Tinh (Tony Tinh) (CEO – Founder of IMM…

source: 30/06/2016 | VTC8
en: June 30, 2016 | VTC8

source: Phóng sự: “Nhà đầu tư cần chuẩn bị gì khi đầu tư EB-5?”
en: Report: "What should investors prepare when investing in EB-5?"

source: VTC8 vừa qua đã đưa tin về vấn đề nhà đầu tư cần chuẩn bị gì khi đầu tư EB-5 nhằm giúp cung cấp thêm thông tin cho các nhà đầu tư. Xem chi tiết.
en: VTC8 recently reported on what investors should prepare when investing in EB-5, to give investors more information. View details.

source: Tháng 06/2016 | VTC8
en: June 2016 | VTC8

source: Phóng sự: "Định cư Mỹ theo diện EB-5 không phải có tiền là được”
en: Report: "Immigrating to the U.S. through EB-5 takes more than money"

source: Trong phóng sự: “Định cư Mỹ theo diện EB-5 không phải có tiền là được”, phát sóng tháng 06/2016 trên kênh truyền hình VTC8, anh Trần Văn Tỉnh (Tony Tỉnh) (Tổng giám đốc – Sáng lập viên IMM Group) đã…
en: In the report "Immigrating to the U.S. through EB-5 takes more than money", aired on VTC8 in June 2016, Mr. Tran Van Tinh (Tony Tinh) (CEO – Founder of IMM Group)…

source: Tháng 06/2015 | VTC8
en: June 2015 | VTC8

source: IMM Group chia sẻ về rủi ro khi tham gia chương trình EB-5 với khán giả VTC8
en: IMM Group discusses the risks of the EB-5 program with VTC8 viewers

source: Trong phóng sự: “Đầu tư EB-5, cơ hội định cư tại Mỹ nhưng không ít rủi ro” phát sóng trên kênh ViewTV (VTC8) ngày 14/06 vừa qua, anh Trần Văn Tỉnh (Tony Tỉnh) (Sáng lập viên – Chủ tịch HĐTV…
en: In the report "EB-5 investment: an opportunity to settle in the U.S., but not without risks", aired on ViewTV (VTC8) on June 14, Mr. Tran Van Tinh (Tony Tinh) (Founder – Chairman of the Members' Council…

source: Tháng 07/2020 | Imidaily.com
en: July 2020 | Imidaily.com

source: Đối tác nước ngoài khen ngợi IMM Group trên chuyên trang điểm tin di trú thế giới
en: Foreign partner praises IMM Group on a global immigration news site

source: Đoạn cuối khi được hỏi: “What investment migration industry personality do you most admire?” Tạm dịch là “Những phẩm chất gì trong lĩnh vực đầu tư định cư mà ông ngưỡng mộ nhất?” Ông James Hartshon, đại diện quỹ đầu…
en: In the closing segment, when asked, "What investment migration industry personality do you most admire?", Mr. James Hartshorn, a representative of the investment…

source: Tháng 06/2016 | VnExpress
en: June 2016 | VnExpress

source: Phóng sự: "Những sai lầm khi đầu tư sang Mỹ lấy thẻ xanh”
en: Report: "Mistakes when investing in the U.S. to obtain a green card"

source: Ông Trần Văn Tỉnh (Tony Tỉnh), Chủ tịch IMM Group, chia sẻ kinh nghiệm đầu tư EB-5 trên báo VNExpress: nhà đầu tư sẽ gặp rủi ro nếu chỉ quan tâm thông tin quảng cáo dự án trong khi điểm…
en: Mr. Tran Van Tinh (Tony Tinh), Chairman of IMM Group, shared his EB-5 investment experience in VnExpress: investors take on risk if they focus only on a project's promotional information while the key…

source: Tháng 06/2016 | Tạp chí Doanh nghiệp & Trang trại Việt Nam
en: June 2016 | Vietnam Farm & Enterprise Magazine

source: IMM Group từ một phòng trọ vươn ra thế giới
en: Magazine feature: IMM Group, from a rented room to the world

source: Câu chuyện có thật về sự hình thành và phát triển của IMM Group. Từ một văn phòng nhỏ trong một phòng trọ, trở thành một tập đoàn Việt Nam tiên phong trong lĩnh vực đầu tư ra nước ngoài.…
en: The true story of how IMM Group was founded and grew: from a small office in a rented room to a pioneering Vietnamese group in outbound investment.…

source: Tháng 12/2015 | VN Express
en: December 2015 | VnExpress

source: Chàng trai bán tàu hủ trở thành ông chủ IMM
en: The young tofu seller who became the owner of IMM

source: Báo VNExpress chia sẻ câu chuyện về hành trình, nỗ lực vượt lên chính mình của ông Trần Văn Tỉnh (Tony Tỉnh). Từ một chàng trai nghèo bán vé số, tàu hủ, từng bước học tập, xây dựng và làm…
en: VnExpress shared the story of the journey of Mr. Tran Van Tinh (Tony Tinh) and his efforts to rise above his circumstances. Starting as a poor young man selling lottery tickets and tofu, he gradually studied, built, and…

source: Xem video →
en: Watch video →

source: Đội ngũ IMM Group
en: The IMM Group team

source: Ban Giám đốc
en: Board of Directors

source: Bộ phận tư vấn & Thụ lý hồ sơ
en: Consultation & Case Processing Department

source: Bộ phận Văn phòng
en: Office Administration

source: Luật sư cố vấn
en: Partner Legal Advisors

source: Chuyên gia cố vấn đầu tư đối tác của IMM Group
en: IMM Group's partner investment advisors

source: Bộ phận phát triển sản phẩm & Nội dung
en: Product & Content Development

source: Phát triển Kinh doanh & Quan hệ Công Chúng
en: Business Development & Public Relations

source: Trần Văn Tỉnh
en: Tran Van Tinh

source: Tony Tỉnh
en: Tony Tinh

source: [Trần Văn Tỉnh](https://immgroup.com/doi-ngu-imm-group/tran-van-tinh/)
en: [Tran Van Tinh](https://immgroup.com/en/our-people/tran-van-tinh/)

source: Nhà sáng lập - Chủ tịch hội đồng thành viên
en: Founder - Chairman

source: Lim Chor Ghee
en: Portrait of Lim Chor Ghee, Co-founder and Corporate Affairs Director of IMM Group

source: [Lim Chor Ghee](https://immgroup.com/doi-ngu-imm-group/lim-chor-ghee/)
en: [Lim Chor Ghee](https://immgroup.com/en/our-people/lim-chor-ghee/)

source: Đồng sáng lập IMM Group - Giám đốc Đối ngoại
en: Co-founder of IMM Group - Corporate Affairs Director

source: Trần Tuấn Anh
en: Portrait of Tran Tuan Anh (Alex), Deputy Chief Operating Officer of IMM Group

source: [Trần Tuấn Anh](https://immgroup.com/doi-ngu-imm-group/tran-tuan-anh/)
en: [Tran Tuan Anh](https://immgroup.com/en/our-people/tran-tuan-anh/)

source: Phó Giám đốc Điều hành - Giám Đốc Thụ Lý Hồ Sơ
en: Deputy Chief Operating Officer - Case Processing Director

source: Thomas Lee
en: Portrait of Thomas Lee, Manager and CEO of IMM Management LLC

source: [Thomas Lee](https://immgroup.com/doi-ngu-imm-group/thomas-lee/)
en: [Thomas Lee](https://immgroup.com/en/our-people/thomas-lee/)

source: Giám Đốc IMM Management LLC
en: Manager and CEO of IMM Management LLC

source: Trần Thị Trúc Linh
en: Portrait of Tran Thi Truc Linh (Elena), Senior Consultant at IMM Group

source: [Trần Thị Trúc Linh](https://immgroup.com/doi-ngu-imm-group/tran-thi-truc-linh/)
en: [Tran Thi Truc Linh](https://immgroup.com/en/our-people/tran-thi-truc-linh/)

source: Nguyễn Thị Minh Thu
en: Portrait of Nguyen Thi Minh Thu (Catherine), Senior Consultant at IMM Group

source: [Nguyễn Thị Minh Thu](https://immgroup.com/doi-ngu-imm-group/nguyen-thi-minh-thu/)
en: [Nguyen Thi Minh Thu](https://immgroup.com/en/our-people/nguyen-thi-minh-thu/)

source: Nguyễn Trường Anh Thư
en: Portrait of Nguyen Truong Anh Thu (Emily), Senior Consultant at IMM Group

source: [Nguyễn Trường Anh Thư](https://immgroup.com/doi-ngu-imm-group/nguyen-truong-anh-thu/)
en: [Nguyen Truong Anh Thu](https://immgroup.com/en/our-people/nguyen-truong-anh-thu/)

source: Võ Thị Thu Thảo
en: Portrait of Vo Thi Thu Thao (Taylor), Senior Consultant at IMM Group

source: [Võ Thị Thu Thảo](https://immgroup.com/doi-ngu-imm-group/vo-thi-thu-thao/)
en: [Vo Thi Thu Thao](https://immgroup.com/en/our-people/vo-thi-thu-thao/)

source: Trần Thị Thu Hà
en: Portrait of Tran Thi Thu Ha (Hayley), Senior Consultant at IMM Group

source: [Trần Thị Thu Hà](https://immgroup.com/doi-ngu-imm-group/tran-thi-thu-ha/)
en: [Tran Thi Thu Ha](https://immgroup.com/en/our-people/tran-thi-thu-ha/)

source: Chuyên viên Tư vấn đầu tư
en: Senior Consultant

source: Nguyễn Thị Minh Trang
en: Portrait of Nguyen Thi Minh Trang (Olive), Case Processing Manager at IMM Group

source: [Nguyễn Thị Minh Trang](https://immgroup.com/doi-ngu-imm-group/nguyen-thi-minh-trang/)
en: [Nguyen Thi Minh Trang](https://immgroup.com/en/our-people/nguyen-thi-minh-trang/)

source: Quản lý bộ phận Thụ lý hồ sơ
en: Case Processing Manager

source: Nguyễn Tấn Huy
en: Portrait of Nguyen Tan Huy (Charles), Senior Case Processing Executive at IMM Group

source: [Nguyễn Tấn Huy](https://immgroup.com/doi-ngu-imm-group/nguyen-tan-huy/)
en: [Nguyen Tan Huy](https://immgroup.com/en/our-people/nguyen-tan-huy/)

source: Phạm Nguyễn Kỳ Duyên
en: Portrait of Pham Nguyen Ky Duyen (Kaylin), Senior Case Processing Executive at IMM Group

source: [Phạm Nguyễn Kỳ Duyên](https://immgroup.com/doi-ngu-imm-group/pham-nguyen-ky-duyen/)
en: [Pham Nguyen Ky Duyen](https://immgroup.com/en/our-people/pham-nguyen-ky-duyen/)

source: Phan Quỳnh Như
en: Portrait of Phan Quynh Nhu (Cassie), Senior Case Processing Executive at IMM Group

source: [Phan Quỳnh Như](https://immgroup.com/doi-ngu-imm-group/phan-quynh-nhu/)
en: [Phan Quynh Nhu](https://immgroup.com/en/our-people/phan-quynh-nhu/)

source: Chuyên viên Thụ lý hồ sơ
en: Senior Case Processing Executive

source: Trần Thị Thanh Thùy
en: Portrait of Tran Thi Thanh Thuy (Carmen), Office and Administration Manager at IMM Group

source: [Trần Thị Thanh Thùy](https://immgroup.com/doi-ngu-imm-group/tran-thi-thanh-thuy/)
en: [Tran Thi Thanh Thuy](https://immgroup.com/en/our-people/tran-thi-thanh-thuy/)

source: Quản lý bộ phận Hành Chính & Quản lý văn phòng
en: Office and Administration Manager

source: Phùng Trung Vinh
en: Portrait of Phung Trung Vinh (Burin), Senior Manager, Marketing Department at IMM Group

source: [Phùng Trung Vinh](https://immgroup.com/doi-ngu-imm-group/phung-trung-vinh/)
en: [Phung Trung Vinh](https://immgroup.com/en/our-people/phung-trung-vinh/)

source: Quản lý cấp cao | Bộ phận Marketing
en: Senior Manager | Marketing Department

source: Nguyễn Thị Thanh Phương
en: Portrait of Nguyen Thi Thanh Phuong (Hellen), Chief Accountant at IMM Group

source: [Nguyễn Thị Thanh Phương](https://immgroup.com/doi-ngu-imm-group/nguyen-thi-thanh-phuong/)
en: [Nguyen Thi Thanh Phuong](https://immgroup.com/en/our-people/nguyen-thi-thanh-phuong/)

source: Kế toán trưởng
en: Chief Accountant

source: Phùng Lương Minh Thảo
en: Portrait of Phung Luong Minh Thao (Grace), Assistant to the Board of Directors at IMM Group

source: [Phùng Lương Minh Thảo](https://immgroup.com/doi-ngu-imm-group/phung-luong-minh-thao/)
en: [Phung Luong Minh Thao](https://immgroup.com/en/our-people/phung-luong-minh-thao/)

source: Trợ lý Ban giám đốc
en: Assistant to the Board of Directors

source: Nguyễn Hữu Hùng
en: Portrait of Nguyen Huu Hung (Frank), Website System Management Team Leader at IMM Group

source: [Nguyễn Hữu Hùng](https://immgroup.com/doi-ngu-imm-group/nguyen-huu-hung/)
en: [Nguyen Huu Hung](https://immgroup.com/en/our-people/nguyen-huu-hung/)

source: Trưởng bộ phận Quản lý hệ thống Website
en: Website System Management Team Leader

source: Phạm Hoàng Đăng Thanh
en: Portrait of Pham Hoang Dang Thanh (Paul), Head of Information Data System Management at IMM Group

source: [Phạm Hoàng Đăng Thanh](https://immgroup.com/doi-ngu-imm-group/pham-hoang-dang-thanh/)
en: [Pham Hoang Dang Thanh](https://immgroup.com/en/our-people/pham-hoang-dang-thanh/)

source: Trưởng bộ phận Quản lý hệ thống thông tin dữ liệu
en: Head of Information Data System Management Department

source: Trần Văn Phú Nghĩa
en: Portrait of Tran Van Phu Nghia (Bryan), Head of Design Department at IMM Group

source: [Trần Văn Phú Nghĩa](https://immgroup.com/doi-ngu-imm-group/tran-van-phu-nghia/)
en: [Tran Van Phu Nghia](https://immgroup.com/en/our-people/tran-van-phu-nghia/)

source: Trưởng bộ phận Thiết kế
en: Head of Design Department

source: Lê Nữ Như Thuý
en: Portrait of Le Nu Nhu Thuy (Tyra), Payroll & Benefits Specialist at IMM Group

source: [Lê Nữ Như Thuý](https://immgroup.com/doi-ngu-imm-group/le-nu-nhu-thuy/)
en: [Le Nu Nhu Thuy](https://immgroup.com/en/our-people/le-nu-nhu-thuy/)

source: Chuyên viên tiền lương & phúc lợi
en: Payroll & Benefits Specialist

source: Trần Thị Cẩm Vân
en: Portrait of Tran Thi Cam Van (Jenny), HR and Administration Specialist at IMM Group

source: [Trần Thị Cẩm Vân](https://immgroup.com/doi-ngu-imm-group/tran-thi-cam-van/)
en: [Tran Thi Cam Van](https://immgroup.com/en/our-people/tran-thi-cam-van/)

source: Chuyên viên Nhân sự kiêm Hành chính
en: HR and Administration Specialist

source: Đặng Phương Anh
en: Portrait of Dang Phuong Anh (Jasper), Translator at IMM Group

source: [Đặng Phương Anh](https://immgroup.com/doi-ngu-imm-group/dang-phuong-anh/)
en: [Dang Phuong Anh](https://immgroup.com/en/our-people/dang-phuong-anh/)

source: Lưu Hiểu Hân
en: Portrait of Luu Hieu Han (Hana), Translator at IMM Group

source: [Lưu Hiểu Hân](https://immgroup.com/doi-ngu-imm-group/luu-hieu-han/)
en: [Luu Hieu Han](https://immgroup.com/en/our-people/luu-hieu-han/)

source: Nhân viên Dịch thuật
en: Translator

source: Nguyễn Quang Đức
en: Portrait of Nguyen Quang Duc (Theodore), Digital Marketing Specialist at IMM Group

source: [Nguyễn Quang Đức](https://immgroup.com/doi-ngu-imm-group/nguyen-quang-duc/)
en: [Nguyen Quang Duc](https://immgroup.com/en/our-people/nguyen-quang-duc/)

source: Chuyên viên Digital Marketing
en: Digital Marketing Specialist

source: Võ Thị Minh Thùy
en: Portrait of Vo Thi Minh Thuy (Stella), Marketing Staff at IMM Group

source: [Võ Thị Minh Thùy](https://immgroup.com/doi-ngu-imm-group/vo-thi-minh-thuy/)
en: [Vo Thi Minh Thuy](https://immgroup.com/en/our-people/vo-thi-minh-thuy/)

source: Nguyễn Trần Anh Thư
en: Portrait of Nguyen Tran Anh Thu (Jasmine), Marketing Staff at IMM Group

source: [Nguyễn Trần Anh Thư](https://immgroup.com/doi-ngu-imm-group/nguyen-tran-anh-thu/)
en: [Nguyen Tran Anh Thu](https://immgroup.com/en/our-people/nguyen-tran-anh-thu/)

source: Nhân viên Marketing
en: Marketing Staff

source: Hoàng Hồ Quý Phúc
en: Portrait of Hoang Ho Quy Phuc (Maxys), Graphic Designer at IMM Group

source: [Hoàng Hồ Quý Phúc](https://immgroup.com/doi-ngu-imm-group/hoang-ho-quy-phuc/)
en: [Hoang Ho Quy Phuc](https://immgroup.com/en/our-people/hoang-ho-quy-phuc/)

source: Nguyễn Hữu Kiên
en: Portrait of Nguyen Huu Kien (Kelvin), Frontend Developer at IMM Group

source: [Nguyễn Hữu Kiên](https://immgroup.com/doi-ngu-imm-group/nguyen-huu-kien/)
en: [Nguyen Huu Kien](https://immgroup.com/en/our-people/nguyen-huu-kien/)

source: Maurice (Morrie) Berez
en: Portrait of Maurice (Morrie) Berez, former Head of EB-5 processing at USCIS and Exclusive Advisor of IMM Group

source: [Maurice (Morrie) Berez](https://immgroup.com/doi-ngu-imm-group/maurice-morrie-berez/)
en: [Maurice (Morrie) Berez](https://immgroup.com/en/our-people/maurice-morrie-berez/)

source: Nguyên Trưởng bộ phận xét duyệt hồ sơ EB-5 tại Sở Di trú Mỹ<br> Cố vấn độc quyền của IMM Group
en: Former Head of EB-5 processing department at USCIS · Exclusive Advisor of IMM Group

source: Robert-P.Gaffney
en: Portrait of Robert P. Gaffney, Founding Attorney

source: [Robert-P.Gaffney](https://immgroup.com/doi-ngu-imm-group/robert-p-gaffney/)
en: [Robert P. Gaffney](https://immgroup.com/en/our-people/robert-p-gaffney/)
